app/controllers/movies_controller.rb

  def index
    @movies = Movie.all
---
SELECT "movies".* FROM "movies" ORDER BY release_date ASC

  def create
    @movie = Movie.new(params[:movie])
    if @movie.save
---
INSERT INTO "movies" ("created_at", "description", "rating", "release_date", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    @movie = Movie.find params[:id]
    if @movie.update_attributes(params[:movie])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "24"]]
UPDATE "movies" SET "release_date" = '2015-11-19 00:00:00.000000', "updated_at" = '2015-11-18 11:26:59.092306' WHERE "movies"."id" = 27

  def edit
    @movie = Movie.find(params[:id])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "24"]]

  def search_tmdb
    title = params[:search_terms]
    @movies = Movie.find_in_tmdb(title)
---
SELECT "movies".* FROM "movies" WHERE "movies"."title" = 'hardware' LIMIT 1