app/controllers/sessions_controller.rb

  def create
    auth=request.env["omniauth.auth"]
    user=Moviegoer.find_by_provider_and_uid(auth["provider"],auth["uid"]) ||
      Moviegoer.create_with_omniauth(auth)
---
INSERT INTO "moviegoers" ("created_at", "name", "provider", "uid", "updated_at") VALUES (?, ?, ?, ?, ?)
SELECT "moviegoers".* FROM "moviegoers" WHERE "moviegoers"."provider" = 'facebook' AND "moviegoers"."uid" = '1008865265823002' LIMIT 1